---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.DividedPathFailures.DividedPathCannotCreateFromGeometry
source: html/340c9813-ec87-34cd-ccca-286ea3d80eb2.htm
---
# Autodesk.Revit.DB.BuiltInFailures.DividedPathFailures.DividedPathCannotCreateFromGeometry Property

Highlighted geometry contains a path or edge that could not be divided.

## Syntax (C#)
```csharp
public static FailureDefinitionId DividedPathCannotCreateFromGeometry { get; }
```